Tekla Open API Reference for Tekla Structures 2025
ChamferMarkPropertyElementTypes Methods
The PropertyElement.PropertyElementType.ChamferMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
DX
Returns the change in the X direction property element type.
DY
Returns the change in the Y direction property element type.
Length
Returns the length property element type.
Name
Returns the name property element type.
Top
See Also
Reference
PropertyElement.PropertyElementType.ChamferMarkPropertyElementTypes Class
Tekla.Structures.Drawing Namespace